TwoPhaseFlow-master/testsuite/advection/test-Leveque/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "simulationParameter"

//boundaryCellSize	4.5;
//keepCellsIntersectingBoundary	1;
maxCellSize	$deltaX;
//minCellSize	0.375;

surfaceFile	"cube.fms";

boundaryLayers
{

}

localRefinement
{


}

// ************************************************************************* //
